results/bun/bun-web-standard.txt
Bundle: 1.7 KB
Startup: 8.7 ms
Memory before: 20.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    127639.32    2673.04  142900.33
  Latency        3.91ms   706.18us    71.09ms
  HTTP codes:
    1xx - 0, 2xx - 1276810, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.79MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    118141.66    2274.74  143810.45
  Latency        4.23ms   582.28us    88.01ms
  HTTP codes:
    1xx - 0, 2xx - 1181866, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    24.79MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    123229.98    2392.27  147062.50
  Latency        4.05ms   398.57us    71.26ms
  HTTP codes:
    1xx - 0, 2xx - 1232826, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    33.26MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       752.94      66.91     913.75
  Latency       13.27ms     3.48ms    37.47ms
  HTTP codes:
    1xx - 0, 2xx - 7539, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     9.92GB/s

Memory after: 49.5 MB