results/bun/bun.txt
Bundle: 2.3 KB
Startup: 8.8 ms
Memory before: 20.2 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    129483.25    6000.69  166410.25
  Latency        3.86ms   517.43us    73.26ms
  HTTP codes:
    1xx - 0, 2xx - 1295098, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.10MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    133985.55    2868.95  168563.17
  Latency        3.73ms   456.29us    72.05ms
  HTTP codes:
    1xx - 0, 2xx - 1340253, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    28.11MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    119269.54    3220.82  137457.33
  Latency        4.19ms     1.35ms   124.28ms
  HTTP codes:
    1xx - 0, 2xx - 1192938, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    30.60MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       748.17      84.18     923.07
  Latency       13.36ms     3.68ms    59.18ms
  HTTP codes:
    1xx - 0, 2xx - 7489, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     9.86GB/s

Memory after: 51.4 MB