results/bun/effect.txt
Bundle: 260.9 KB
Startup: 33.0 ms
Memory before: 40.1 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    108719.00    4120.27  119791.51
  Latency        4.60ms   466.25us    70.55ms
  HTTP codes:
    1xx - 0, 2xx - 1087463, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    17.10MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     99320.61    3517.24  110045.87
  Latency        5.03ms     1.00ms   111.73ms
  HTTP codes:
    1xx - 0, 2xx - 993550, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.51MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     87987.33    4784.58   99226.23
  Latency        5.68ms     1.14ms   101.02ms
  HTTP codes:
    1xx - 0, 2xx - 880219, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.57MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       735.34      60.06     852.85
  Latency       13.59ms     3.62ms    36.19ms
  HTTP codes:
    1xx - 0, 2xx - 7363, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     9.69GB/s

Memory after: 76.0 MB