results/bun/elysia.txt
Bundle: 171.4 KB
Startup: 15.2 ms
Memory before: 28.5 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    158497.33    4498.23  179807.11
  Latency        3.15ms   491.31us    67.53ms
  HTTP codes:
    1xx - 0, 2xx - 1585222, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    30.98MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    132757.85    2930.11  154198.46
  Latency        3.76ms     0.94ms   102.91ms
  HTTP codes:
    1xx - 0, 2xx - 1328057, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    27.85MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    122588.49    2506.15  146470.67
  Latency        4.08ms   457.88us    69.76ms
  HTTP codes:
    1xx - 0, 2xx - 1226417, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    33.09MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       779.11      52.89     886.64
  Latency       12.82ms     3.25ms    31.05ms
  HTTP codes:
    1xx - 0, 2xx - 7802, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    10.27GB/s

Memory after: 54.4 MB