results/bun/express.txt
Bundle: 821.1 KB
Startup: 34.7 ms
Memory before: 49.1 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     71034.84    4473.97   76767.27
  Latency        7.04ms     1.74ms   139.96ms
  HTTP codes:
    1xx - 0, 2xx - 710531, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    15.37MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     69509.08    3602.27   75079.09
  Latency        7.19ms   182.15us    17.81ms
  HTTP codes:
    1xx - 0, 2xx - 695389, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    17.76MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     56855.33    2977.89   61602.84
  Latency        8.79ms   648.69us    52.64ms
  HTTP codes:
    1xx - 0, 2xx - 568898, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    17.94MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       235.48     149.29     505.93
  Latency       42.41ms     1.88ms    49.64ms
  HTTP codes:
    1xx - 0, 2xx - 2360, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.11GB/s

Memory after: 201.3 MB