results/bun/h3.txt
Bundle: 22.5 KB
Startup: 10.7 ms
Memory before: 25.0 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    139396.93    2919.51  154994.83
  Latency        3.58ms   485.07us    69.55ms
  HTTP codes:
    1xx - 0, 2xx - 1394351, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    23.80MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    126719.88    2722.22  158806.53
  Latency        3.94ms   246.48us    38.47ms
  HTTP codes:
    1xx - 0, 2xx - 1267661, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    26.59MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    119644.56    6326.51  137616.00
  Latency        4.18ms     1.11ms   102.27ms
  HTTP codes:
    1xx - 0, 2xx - 1196823, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    32.29MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       703.12     109.97     935.77
  Latency       14.20ms     4.30ms    46.45ms
  HTTP codes:
    1xx - 0, 2xx - 7046, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     9.27GB/s

Memory after: 60.8 MB