results/bun/hono.txt
Bundle: 20.4 KB
Startup: 11.5 ms
Memory before: 25.3 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    138946.07    5554.93  155892.87
  Latency        3.60ms   535.73us    68.08ms
  HTTP codes:
    1xx - 0, 2xx - 1390038, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    23.72MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    120098.43    7016.32  139663.54
  Latency        4.16ms   826.85us   109.30ms
  HTTP codes:
    1xx - 0, 2xx - 1200908, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    25.30MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    113533.96    8671.90  139754.95
  Latency        4.40ms   746.79us    40.16ms
  HTTP codes:
    1xx - 0, 2xx - 1135726, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    29.12MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       669.70     120.67     869.99
  Latency       14.92ms     4.66ms    48.53ms
  HTTP codes:
    1xx - 0, 2xx - 6707, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     8.82GB/s

Memory after: 55.6 MB